# DBMS

DBMS -Database Management System (DBMS) is a software that is used to define, create and maintain a database and provides controlled access to the data.

There are two types of DBMS

Relational -Relational databases store data in rows and columns like a spreadsheet

Example - Microsoft SQL Server, Oracle Database, MySQL ,sqlite



Non Retational -non-relational databases store data don't, using a storage model (one of four) that is best suited for the type of data it's storing.

Example -MongoDB, Apache Cassandra, Redis, no sql

DBMS Licensed or proprietor - Microsoft SQL Server, Oracle


Open-source DBMS - SQLite

There are 3 types of structure query language

DDL-Data Definition Language - Create,Alter,Drop

DML-Data Manipulation Language - select,update,delete,insert

DCL-Data Control Language. - commit,rollback,revoke,grant

In [1]:
import sqlite3

In [2]:
# create databse

dbcon=sqlite3.connect('testdatabase.db')

In [3]:

cur=dbcon.cursor()

In [4]:
cur.execute('create table student8(rollno int primary key,name text,marks int)')

OperationalError: table student8 already exists

In [8]:
cur.execute('insert into student8(rollno,name,marks)values(1,"ABC",78)')

In [62]:
results=cur.execute('select * from student8')

for i in results:
    print(i)

(1, 'ABC', 78)

In [63]:
cur.execute('insert into student8(rollno,name,marks)values(2,"john",80)')

In [64]:
cur.execute('insert into student8(rollno,name,marks)values(3,"Andrew",87)')

In [65]:
cur.execute('insert into student8(rollno,name,marks)values(4,"Lisa",88)')

In [66]:
cur.execute('insert into student8(rollno,name,marks)values(5,"jack",94)')

In [67]:
results=cur.execute('select * from student8')

for i in results:
    print(i)

(1, 'ABC', 78)
(2, 'john', 80)
(3, 'Andrew', 87)
(4, 'Lisa', 88)
(5, 'jack', 94)

In [12]:
cur.execute('insert into student8 values(6,"Tom",50)')

In [13]:
results=cur.execute('select * from student8')

for i in results:
    print(i)

(1, 'ABC', 78)
(2, 'john', 80)
(3, 'Andrew', 87)
(4, 'Lisa', 88)
(5, 'jack', 94)
(6, 'Tom', 50)

In [14]:
results=cur.execute('select rollno,name,marks from student8')

for i in results:
    print(i)

(1, 'ABC', 78)
(2, 'john', 80)
(3, 'Andrew', 87)
(4, 'Lisa', 88)
(5, 'jack', 94)
(6, 'Tom', 50)

In [15]:
results=cur.execute('select * from student8 where rollno=1')

for i in results:
    print(i)

(1, 'ABC', 78)

In [16]:
results=cur.execute('select * from student8 where rollno=2')

for i in results:
    print(i)

(2, 'john', 80)

In [17]:
results=cur.execute('select * from student8 where rollno=5')

for i in results:
    print(i)

(5, 'jack', 94)

In [18]:
results=cur.execute('select * from student8 where name="jack"')

for i in results:
    print(i)

(5, 'jack', 94)

In [68]:
results=cur.execute('select * from student8 where name="Tom"')

for i in results:
    print(i)

In [20]:
results=cur.execute('select * from student8 where name="Lisa"')

for i in results:
    print(i)

(4, 'Lisa', 88)

In [22]:
results=cur.execute('select * from student8 where name="Lisa"')

results.fetchone()

(4, 'Lisa', 88)

In [23]:
results=cur.execute('select * from student8')

results.fetchall()

[(1, 'ABC', 78),
 (2, 'john', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94),
 (6, 'Tom', 50)]

In [24]:
results=cur.execute('select * from student8 order by name asc')

results.fetchall()

[(1, 'ABC', 78),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (6, 'Tom', 50),
 (5, 'jack', 94),
 (2, 'john', 80)]

In [25]:
results=cur.execute('select * from student8 order by name desc')

results.fetchall()

[(2, 'john', 80),
 (5, 'jack', 94),
 (6, 'Tom', 50),
 (4, 'Lisa', 88),
 (3, 'Andrew', 87),
 (1, 'ABC', 78)]

In [26]:
results=cur.execute('select * from student8 order by rollno desc')

results.fetchall()

[(6, 'Tom', 50),
 (5, 'jack', 94),
 (4, 'Lisa', 88),
 (3, 'Andrew', 87),
 (2, 'john', 80),
 (1, 'ABC', 78)]

In [27]:
results=cur.execute('select * from student8 order by rollno asc')

results.fetchall()

[(1, 'ABC', 78),
 (2, 'john', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94),
 (6, 'Tom', 50)]

In [28]:
results=cur.execute('select * from student8 where marks between 80 and 90')

results.fetchall()

[(2, 'john', 80), (3, 'Andrew', 87), (4, 'Lisa', 88)]

In [30]:
results=cur.execute('select * from student8 where marks>80 and marks<90')

results.fetchall()

[(3, 'Andrew', 87), (4, 'Lisa', 88)]

In [31]:
results=cur.execute('select * from student8 where rollno in (1,2,3)')

results.fetchall()

[(1, 'ABC', 78), (2, 'john', 80), (3, 'Andrew', 87)]

In [33]:
results=cur.execute('select * from student8 where name in ("john","Lisa")')

results.fetchall()

[(2, 'john', 80), (4, 'Lisa', 88)]

# Create table

In [34]:
#student database will be created in jupiter note book 


# first connection object

db=sqlite3.connect('student_database.db')

# cursor

A cursor holds the rows (one or more) returned by a SQL statement. The set of rows the cursor holds is referred to as the active set. You can name a cursor so that it could be referred to in a program to fetch and process the rows returned by the SQL statement, one at a time.

In [35]:
# create cursor object

cur=db.cursor()

# Create Table student in database

In [38]:
cur.execute('create table student9(id int primary key,name text,marks int)')

# insert data in student table

In [40]:
cur.execute('insert into student9 values(1,"john",90)')

db.commit()

In [41]:
cur.execute('insert into student9 values(2,"teena",100)')

db.commit()

# Select in student table

In [42]:
res=cur.execute('select * from student9')

res.fetchall()

[(1, 'john', 90), (2, 'teena', 100)]

# sql data type

integer.......numerical value
real........decimal values
text........character values
char(20)......character values

In [46]:
# SHOW HOW MANY ROW INSERTED


print(cur.rowcount,'Record(S) inserted')

-1 Record(S) inserted

In [47]:
# MULTIPLE RECORDS INSERTION

cur.execute('insert into student9 values(3,"kiara",75),(4,"jack",95)')
db.commit()

print(cur.rowcount,"records inserted")

2 records inserted

In [48]:
res=cur.execute('select * from student9')

res.fetchall()

[(1, 'john', 90), (2, 'teena', 100), (3, 'kiara', 75), (4, 'jack', 95)]

Database will be created in given location

In [49]:
db1=sqlite3.connect("C:/MySQLite_DataBase/emp_database.db")

In [50]:
cur=db1.cursor()

In [52]:
cur.execute('create table employee2(id int,name text,age int)')

In [54]:
cur.execute('insert into employee2 values(1,"melin",23)')
db1.commit()

In [55]:
print(cur.rowcount,"records inserted")

1 records inserted

In [56]:
res=cur.execute('select * from employee2')

for i in res:
    print(i)

(1, 'melin', 23)

working with original data base ...........student8

# Accessing data stored in SQLite using python

In [70]:
result=cur.execute('select * from student8')

result.fetchall()

[(1, 'ABC', 78),
 (2, 'john', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94)]

In [73]:
result=cur.execute('select name from student8')

result.fetchall()

[('ABC',), ('john',), ('Andrew',), ('Lisa',), ('jack',)]

In [75]:
result=cur.execute('select rollno,name from student8')

result.fetchall()

[(1, 'ABC'), (2, 'john'), (3, 'Andrew'), (4, 'Lisa'), (5, 'jack')]

# SQL Clause

In [76]:
result=cur.execute('select rollno,name from student8 where rollno=1')

result.fetchall()

[(1, 'ABC')]

In [77]:
result=cur.execute('select rollno,name from student8 where rollno=2')

result.fetchall()

[(2, 'john')]

In [78]:
result=cur.execute('select rollno,name from student8 where rollno=5')

result.fetchall()

[(5, 'jack')]

In [79]:
result=cur.execute('select name from student8 where rollno=5')

result.fetchall()

[('jack',)]

In [82]:
result=cur.execute('select * from student8 limit 3')

result.fetchall()

[(1, 'ABC', 78), (2, 'john', 80), (3, 'Andrew', 87)]

In [83]:
result=cur.execute('select marks from student8 where rollno=5')

result.fetchall()

[(94,)]

In [84]:
result=cur.execute('select marks from student8 where name="ABC"')

result.fetchall()

[(78,)]

In [87]:
result=cur.execute('select marks from student8 where name="john"')

result.fetchall()

[(80,)]

In [89]:
result=cur.execute('select marks from student8 where marks>80 and marks<90')

result.fetchall()

[(87,), (88,)]

In [92]:
result=cur.execute('select marks from student8 where marks between 78 and 88')

result.fetchall()

[(78,), (80,), (87,), (88,)]

In [93]:
result=cur.execute('select marks from student8 where rollno in (1,2)')

result.fetchall()

[(78,), (80,)]

In [95]:
result=cur.execute('select * from student8 order by rollno asc')

result.fetchall()

[(1, 'ABC', 78),
 (2, 'john', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94)]

In [96]:
result=cur.execute('select name from student8 order by rollno asc')

result.fetchall()

[('ABC',), ('john',), ('Andrew',), ('Lisa',), ('jack',)]

In [97]:
result=cur.execute('select * from student8 order by name asc')

result.fetchall()

[(1, 'ABC', 78),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94),
 (2, 'john', 80)]

In [98]:
result=cur.execute('select * from student8 order by name desc')

result.fetchall()

[(2, 'john', 80),
 (5, 'jack', 94),
 (4, 'Lisa', 88),
 (3, 'Andrew', 87),
 (1, 'ABC', 78)]

In [101]:
result=cur.execute('select * from student8 where rollno=2 or marks=78')

result.fetchall()

[(1, 'ABC', 78), (2, 'john', 80)]

In [103]:
result=cur.execute('select * from student8 where name="john" or marks=78')

result.fetchall()

[(1, 'ABC', 78), (2, 'john', 80)]

In [107]:
result=cur.execute('select * from student8 where marks between 78 and 88')

result.fetchall()

[(1, 'ABC', 78), (2, 'john', 80), (3, 'Andrew', 87), (4, 'Lisa', 88)]

In [113]:
result=cur.execute('select * from student8 where marks is null')

result.fetchall()

[]

In [114]:
result=cur.execute('select * from student8 where marks is not null')

result.fetchall()

[(1, 'ABC', 78),
 (2, 'john', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94)]

# Aggregate functions in SQL

MIN, MAX, COUNT, SUM,AVG

In [108]:
result=cur.execute('select min(marks) from student8 ')

result.fetchall()

[(78,)]

In [109]:
result=cur.execute('select max(marks) from student8 ')

result.fetchall()

[(94,)]

In [110]:
result=cur.execute('select sum(marks) from student8 ')

result.fetchall()

[(427,)]

In [111]:
result=cur.execute('select count(marks) from student8 ')

result.fetchall()

[(5,)]

In [112]:
result=cur.execute('select avg(marks) from student8 ')

result.fetchall()

[(85.4,)]

# Like Operators

The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator

percent sign (%) - represents zero, one, or multiple characters.

underscore sign (_) - represents one, single character.

In [115]:
result=cur.execute('select * from student8 ')

result.fetchall()

[(1, 'ABC', 78),
 (2, 'john', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94)]

In [116]:
result=cur.execute('select * from student8 where name like "A%" ')

result.fetchall()

[(1, 'ABC', 78), (3, 'Andrew', 87)]

In [117]:
result=cur.execute('select * from student8 where name like "j%" ')

result.fetchall()

[(2, 'john', 80), (5, 'jack', 94)]

In [118]:
result=cur.execute('select * from student8 where name like "_a%" ')

result.fetchall()

[(5, 'jack', 94)]

In [120]:
result=cur.execute('select * from student8 where name like "____"')
result.fetchall()

[(2, 'john', 80), (4, 'Lisa', 88), (5, 'jack', 94)]

In [121]:
result=cur.execute('select * from student8 where name not in ("john")')
result.fetchall()

[(1, 'ABC', 78), (3, 'Andrew', 87), (4, 'Lisa', 88), (5, 'jack', 94)]

In [122]:
result=cur.execute('select * from student8 where marks not in (78)')
result.fetchall()

[(2, 'john', 80), (3, 'Andrew', 87), (4, 'Lisa', 88), (5, 'jack', 94)]

# Update records

In [123]:
sql="update student8 set marks=100 where rollno=2"

cur.execute(sql)

In [124]:
result=cur.execute('select * from student8')
result.fetchall()

[(1, 'ABC', 78),
 (2, 'john', 100),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'jack', 94)]

In [125]:
sql="update student8 set marks=90 where rollno=3"

cur.execute(sql)

db.commit()

In [126]:
result=cur.execute('select * from student8 where rollno=3')
result.fetchall()

[(3, 'Andrew', 90)]

In [129]:
# multiple update using in


sql="update student8 set marks=90 where rollno in (1,2)"

cur.execute(sql)

db.commit()

In [130]:
result=cur.execute('select * from student8')
result.fetchall()

[(1, 'ABC', 90),
 (2, 'john', 90),
 (3, 'Andrew', 90),
 (4, 'Lisa', 88),
 (5, 'jack', 94)]

# Delete from student table

In [131]:
sql='delete from student8 where rollno=5'

cur.execute(sql)

In [132]:
result=cur.execute('select * from student8')
result.fetchall()

[(1, 'ABC', 90), (2, 'john', 90), (3, 'Andrew', 90), (4, 'Lisa', 88)]

In [133]:
sql='drop table student8'

cur.execute(sql)

In [134]:
result=cur.execute('select * from student8')
result.fetchall()

OperationalError: no such table: student8

In [135]:
db.close()

# Adding data in table with CSV (Comma sepreted values) file directly

In [137]:
import sqlite3

In [140]:
db=sqlite3.connect("C:/MySQLite_DataBase/scores_database.db")

# declare cursor
cur=db.cursor()

In [146]:
cur.execute('create table scores5(gender text, student_id int primary key,marks int)')

In [148]:
cur.execute('insert into scores5 values("male",100,85)')

db.commit()

In [149]:
res=cur.execute('select * from scores5')

res.fetchall()

[('male', 100, 85)]

# inserting records from csv file

In [161]:
with open('scores3_file.csv','r')as file:
    total_records=0
    for row in file:
        cur.execute('insert into scores3 values(?,?,?)',row.split(","))
        db.commit()
        total_records+=1
print(total_records,'records inserted')

7 records inserted

In [162]:
result=cur.execute('select * from scores3')

result.fetchall()

[('male', 100, 55),
 ('male', 101, 56),
 ('male', 102, 58),
 ('male', 103, 59),
 ('male', 104, 60),
 ('male', 105, 61),
 ('male', 106, 60),
 ('male', 107, 70),
 ('male', 108, 71),
 ('male', 109, 72),
 ('male', 110, 73),
 ('male', 111, 74),
 ('male', 112, 75)]

In [163]:
#single record update

sql='update scores3 set marks=100 where student_id=106'

cur.execute(sql)

In [164]:
result=cur.execute('select * from scores3')

result.fetchall()

[('male', 100, 55),
 ('male', 101, 56),
 ('male', 102, 58),
 ('male', 103, 59),
 ('male', 104, 60),
 ('male', 105, 61),
 ('male', 106, 100),
 ('male', 107, 70),
 ('male', 108, 71),
 ('male', 109, 72),
 ('male', 110, 73),
 ('male', 111, 74),
 ('male', 112, 75)]

In [165]:
result=cur.execute('select * from scores3 order by marks asc')

result.fetchall()

[('male', 100, 55),
 ('male', 101, 56),
 ('male', 102, 58),
 ('male', 103, 59),
 ('male', 104, 60),
 ('male', 105, 61),
 ('male', 107, 70),
 ('male', 108, 71),
 ('male', 109, 72),
 ('male', 110, 73),
 ('male', 111, 74),
 ('male', 112, 75),
 ('male', 106, 100)]

In [166]:
result=cur.execute('select * from scores3 order by marks desc')

result.fetchall()

[('male', 106, 100),
 ('male', 112, 75),
 ('male', 111, 74),
 ('male', 110, 73),
 ('male', 109, 72),
 ('male', 108, 71),
 ('male', 107, 70),
 ('male', 105, 61),
 ('male', 104, 60),
 ('male', 103, 59),
 ('male', 102, 58),
 ('male', 101, 56),
 ('male', 100, 55)]

In [167]:
result=cur.execute('select min(marks)from scores3')

result.fetchall()

[(55,)]

In [168]:
result=cur.execute('select max(marks)from scores3')

result.fetchall()

[(100,)]